## Plan Result (parser-graphql-wrapper-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11244896470)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:1072" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "ITEM_SUMMARY_TABLE"
                            value = "PARSER-Prod-item-summary"
                        },
                      ~ {
                            name  = "OTLP_COLLECTOR_URL"
                          ~ value = "https://otel-collector.readitlater.com:443" -> "https://otel-collector.readitlater.com"
                        },
                        {
                            name  = "REDIS_IS_CLUSTER"
                            value = "false"
                        },
                        # (3 unchanged elements hidden)
                    ]
                    name                   = "app"
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ revision                 = 1072 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-parsergraphqlwrapper"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ParserGraphQLWrapper"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:1072" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":803,"Program":"tfcmt","SHA1":"6e21b41ff56506d2a75fd08b644c388e616158e7","Target":"parser-graphql-wrapper-cdk-production","Vars":{},"WorkflowName":"Parser GraphQL Wrapper"} -->